docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-10 dom 23:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>solaR: Solar Radiation and Photovoltaic Systems with R</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Oscar Perpiñán Lamigueiro" />
<meta name="description" content="solaR"
 />
<link rel="stylesheet" type="text/css" href="styles.css" />
</head>
<body>
<div id="content">
<h1 class="title">solaR: Solar Radiation and Photovoltaic Systems with R</h1>

<div id="outline-container-orgfec6be1" class="outline-2">
<h2 id="orgfec6be1">Introduction</h2>
<div class="outline-text-2" id="text-orgfec6be1">
<p>
The <code>solaR</code> package allows for reproducible research both for
photovoltaics (PV) systems performance and solar radiation. It
includes a set of classes, methods and functions to calculate the
sun geometry and the solar radiation incident on a photovoltaic
generator and to simulate the performance of several applications
of the photovoltaic energy. This package performs the whole
calculation procedure from both daily and intradaily global
horizontal irradiation to the final productivity of grid-connected
PV systems and water pumping PV systems.
</p>

<p>
It is designed using a set of S4 classes whose core is a group of
slots with multivariate time series. The classes share a variety
of methods to access the information and several visualization
methods. In addition, the package provides a tool for the visual
statistical analysis of the performance of a large PV plant
composed of several systems.
</p>

<p>
Although <code>solaR</code> is primarily designed for time series associated to
a location defined by its latitude/longitude values and the
temperature and irradiation conditions, it can be easily combined
with spatial packages for space-time analysis.  
</p>
</div>
</div>

<div id="outline-container-orgc963ff4" class="outline-2">
<h2 id="orgc963ff4">Software</h2>
<div class="outline-text-2" id="text-orgc963ff4">
<p>
The stable version of <code>solaR</code> is hosted at <a href="http://cran.r-project.org/package%3DsolaR">CRAN</a>. 
The development version is available at <a href="http://github.com/oscarperpinan/solar/">GitHub</a>.
</p>
</div>
</div>

<div id="outline-container-orgaa4cffb" class="outline-2">
<h2 id="orgaa4cffb">Documentation</h2>
<div class="outline-text-2" id="text-orgaa4cffb">
<p>
The best place to learn how to use the package is the companion <a href="https://doi.org/10.18637/jss.v050.i09">paper</a>
published by the Journal of Statistical Software. <a href="https://oscarperpinan.github.io/esf/">This book</a> (in
Spanish) contains detailed information about solar radiation and
photovoltaic systems. In <a href="http://oscarperpinan.github.io/">my articles</a> I frequently use <code>solaR</code>.
</p>
</div>
</div>

<div id="outline-container-org49bec2c" class="outline-2">
<h2 id="org49bec2c">Citation</h2>
<div class="outline-text-2" id="text-org49bec2c">
<p>
If you use <code>solaR</code>, please cite it in any publication reporting
results obtained with this software:
</p>

<div class="org-src-container">
<pre class="src src-verbatim">Perpiñán Lamigueiro, O. (2012).
solaR: Solar Radiation and Photovoltaic Systems with R.
Journal of Statistical Software, 50(9), 1–32.
https://doi.org/10.18637/jss.v050.i09
</pre>
</div>

<p>
A BibTeX entry for LaTeX users is
</p>
<div class="org-src-container">
<pre class="src src-verbatim">  @Article{,
    title = {{solaR}: Solar Radiation and Photovoltaic Systems with {R}},
    author = {Oscar Perpi{\~n}{\'a}n},
    journal = {Journal of Statistical Software},
    year = {2012},
    volume = {50},
    number = {9},
    pages = {1--32},
    doi = {10.18637/jss.v050.i09}
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b43fe0" class="outline-2">
<h2 id="org1b43fe0">References</h2>
<div class="outline-text-2" id="text-org1b43fe0">
<p>
<code>solaR</code> has been cited in <a href="https://scholar.google.com/scholar?oi=bibs&amp;hl=es&amp;cites=3271105799150114365">several papers</a>.
</p>

<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Oscar Perpiñán Lamigueiro</p>
<p class="date">Created: 2021-10-10 dom 23:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
